{"pages":[{"text":"Linux User တွေအနေနဲ့ သိထားသင့်တဲ့ Terminal အသုံးပြုပုံလေးတွေပါ။ အပြည့်အစုံကြီး မဟုတ်ပေမယ့် အသုံးဝင်တဲ့ နည်းလမ်းလေးတချို့ကိုပဲ အသုံးများတဲ့ Ubuntu ပေါ်အခြေခံပြီး အဓိကထားမျှဝေလိုက်ပါတယ်။ Shortcuts Terminal အသစ်ဖွင့် Control + Alter + T Tab အသစ်ဖွင့် Control + Shift + T Zoom In (စာလုံးကြီး) Control + Shift + = (Control + +) Zoom Out (စာလုံးသေး) Control + - Copy Control + Shift + C Paste Control + Shift + V Command အစသို့ Control + A Command ဖျက် Control + U Command Completion Ubuntu ရဲ့ Terminal မှာ ကိုယ်ရိုက်လိုက်တဲ့ command ရဲ့ စာလုံး အပြည့်အစုံကို Tab key ၂ချက်နှိပ်ပြီး ဖြည့်နိုင်ပါတယ်။ ဥပမာအနေနဲ့ apt လို့ရိုက်ပြီး Tab key ၂ချက်နှိပ်လိုက်မယ်ဆိုရင် ပုံမှာပြထားတဲ့အတိုင်း apt နဲ့စတဲ့ command တွေပြပေးပါလိမ့်မယ်။ i တစ်လုံးထပ်တိုးပြီး ( apti ) Tab ထပ်နှိပ်ပါက aptitude ဆိုပြီး ဖြည့်ပေးသွားမှာပါ။ Command အစစာလုံး တစ်လုံး နှစ်လုံးရိုက်ပြီး Tab နှိပ်တာနဲ့ အဲဒီ စာလုံးနဲ့စတဲ့ Command ကိုပြပေးသွားတာဖြစ်ပါတယ်။ $ apt [ tab ][ tab ] $ apti [ tab ][ tab ] Directory လမ်းကြောင်းတွေမှာလဲသုံးနိုင်ပါတယ်။ $ cd Do [ tab ][ tab ] $ cd Dow [ tab ][ tab ] မှတ်ချက်။ ။ တချို့ Distro တွေမှာတော့ Completion အလုပ်လုပ်ဖို့ configure ပြန်လုပ်ပေးဖို့ လိုပါတယ်။ History Terminal ထဲ ရိုက်ထားတဲ့ command တွေကိုတော့ keyboard က Up Arrow key နှိပ်ပြီး ပြန်ခေါ်သုံးနိုင်ပါတယ်။ အကယ်၍များ ရိုက်ဖူးတဲ့ command တစ်ခုကို အပြည့်အစုံမမှတ်မိခဲ့ရင် history command သုံးပြီး ပြန်ရှာနိုင်ပါတယ်။ ပုံမှာပါတဲ့အတိုင်း history | grep နဲ့တွဲပြီး ကိုယ်ရှာချင်တဲ့ command မှာပါတဲ့ စာသာတချို့ ရိုက်ထည့်ပေးရမှာပါ။ $ history | grep [ some_part_of_command ] ! - Bang နောက်ဆုံးရိုက်ခဲ့တဲ့ command ကိုပြန်ခေါ်ချင်တယ်ဆိုရင်တော့ !! ကိုသုံးနိုင်ပါတယ်။ $ gedit /tmp/test $ !! ဥပမာပြထားတဲ့အတိုင်း ပထမ ရိုက်လိုက်တဲ့ \"gedit /tmp/test\" ဆိုတဲ့ command ကိုပြန် ခေါ်ချင်တယ်ဆိုရင် အပြည့်အစုံ ပြန်ရိုက်စရာမလိုပါဘူး။ !! လို့ရိုက်လိုက်တာနဲ့ \"gedit /tmp/test\" ဆိုတဲ့ command ပြန်ရိုက်ပြီးသားဖြစ်သွားမှာပါ။ $ gedit /tmp/test $ cd ~/Download $ !ge gedit command သုံးပြီးတဲ့နောက် Home အောက်က Download ဆိုတဲ့ folder ထဲကို ပြောင်းတဲ့ command ရိုက်လိုက်ပါတယ်။ !! လို့ရိုက်ရင်တော့ \"cd ~/Download\" ဆိုတဲ့ command ကို ပြန်ခေါ်တာဖြစ်သွားပါလိမ့်မယ်။ ပြထားတဲ့အတိုင်း !ge လို့ရိုက်လိုက်ရင်တော့ History ထဲက ge နဲ့စတဲ့ command တွေထဲကမှ နောက်ဆုံး command ကိုပြန်ခေါ်ပေးမှာပါ။ \"gedit /tmp/test\" လို့ပြန်ရိုက်လိုက်တာနဲ့အတူတူပါပဲ။ အကယ်၍များ ရိုက်လိုက်တဲ့ command တစ်ခုက root permission လိုခဲ့မယ်ဆိုရင်လဲ အကုန်ပြန်ရိုက်စရာမလိုပါဘူး။ sudo !! လို့ပဲရိုက်စရာလိုပါတယ်။ $ apt-get update $ sudo !! ပုံမှာပြထားတဲ့အတိုင်း ပထမ apt-get update လို့ရိုက်လိုက်ပါတယ်။ root permission လိုတယ်ဆိုပြီး error ပြလာတဲ့အတွက် sudo command နဲ့ \"sudo apt-get update\" ဆိုပြီးပြန်ရိုက်ရမှာပါ။ ဒါပေမယ့် အပြည့်အစုံပြန်မရိုက်ပဲ sudo !! ကိုသုံးလိုက်တာပါ။ အပေါ်မှာပြောခဲ့တဲ့အတိုင်း !! က နောက်ဆုံးရိုက်လိုက်တဲ့ command ကိုပြန်ခေါ်ပေးတာပါ။ ဒါကြောင့် sudo !! လို့ရိုက်လိုက်တာက sudo apt-get update လို့ရိုက်လိုက်တာနဲ့ အတူတူဖြစ်သွားပါတယ်။ !? ကိုတော့ ရိုက်ဖူးတဲ့ command တွေထဲကမှ သတ်မှတ်ထားတဲ့ စာသားပါတဲ့ command ကိုပြန်ခေါ်တဲ့အခါသုံးနိုင်ပါတယ်။ $ gedit /tmp/test $ gedit ~/Documents/test $ !?mp $ !?men ! ကို တခြား သုံးလို့ရတာလေးတွေရှိပါသေးတယ်။ သိပ် အသုံးမဝင်ပေမယ့် သိထားရအောင်ပါ။ အောက်မှာပြထားတဲ့အတိုင်း အစဉ်လိုက် ရိုက်ပြီး စမ်းကြည့်ပါ။ sudo apt-get upgrade ရိုက်လိုက်လို့ password ဒါမှမဟုတ် Yes/No မေးလာခဲ့ရင် ဆက်မသွားပဲ Control+C နှိပ်ပြီး cancel လုပ်နိုင်ပါတယ်။ ပြီးမှ ! နဲ့စတဲ့ command ကို ဆက်ရိုက်ပါ။ $ !1 $ !2 $ sudo apt-get upgrade $ !:0 $ sudo apt-get upgrade $ !:1 $ sudo apt-get upgrade $ !:-1 $ sudo apt-get upgrade $ !:-2 ရလာမယ့် result တွေကတော့ !1 => History ထဲမှ ထမဦးဆုံး command ပါ။ history | more ဆိုတဲ့ command နဲ့ စစ်ကြည့်နိုင်ပါတယ်။ !2 => History ထဲမှ ဒုတိယ command ပါ။ !:0 => နောက်ဆုံးရိုက်ထားသော command ( sudo apt-get upgrade ) ရဲ့ ပထမဆုံး အပိုင်း sudo ကိုတွေ့ရပါလိမ့်မယ်။ !:1 => sudo apt-get upgrade ရဲ့ ဒုတိယအပိုင်း apt-get ကိုတွေ့ရပါလိမ့်မယ်။ !:-1 => sudo apt-get upgrade ရဲ့ရှေ့ ၂ပိုင်း sudo apt-get ကိုတွေ့ရမှာပါ။ !:-2 => !! ရိုက်လိုက်သလိုပါပဲ sudo apt-get upgrade အပြည့်အစုံ ပြန်မြင်ရပါလိမ့်မယ်။ Command ရှည်ရင်ရှည်သလို !: နောက်က နံပါတ်ကို တိုးသွားနိုင်ပါတယ်။ !2:1 !2:-1 စသဖြင့်လဲ ပေါင်းစပ်ရေးသားနိုင်ပါသေးတယ်။ နောက်ဆုံးရိုက်ခဲ့တဲ့ command ရဲ့ Parameter တွေလိုချင်ရင် $ !!* နောက်ဆုံးရိုက်ခဲ့တဲ့ command ရဲ့ ပထမဆုံး Parameter ကိုလိုချင်ရင် $ !!&#94; နောက်ဆုံးရိုက်ခဲ့တဲ့ command ရဲ့ နောက်ဆုံး Parameter ကိုလိုချင်ရင် $ !! $ နောက်ဆုံးရိုက်ခဲ့တဲ့ command ရဲ့ ဒုတိယမြောက် Parameter ကိုလိုချင်ရင် $ !!2 !!:p ဆိုတာရှိပါသေးတယ်။ !! နဲ့ကွာခြားတာက !! က နောက်ဆုံး command ကို တန်း run ပေးတာဖြစ်ပြီး !!:p က စာသား ရိုက်ထုတ်ပေးရုံသက်သက်ပဲဖြစ်ပါတယ်။ $ !!:p နောက်ဆုံးရိုက်ထားတဲ့ command ကိုမှ စာသားတချို့ အစားထိုးချင်တယ်ဆိုရင်တော့ !!:s ကိုသုံးနိုင်ပါတယ်။ !!:s/[ပြင်လိုသည့်စာသား]/[ပြင်မည့်စာသား]/ ပြထားတဲ့ format အတိုင်း ရိုက်ပြီး ပြင်နိုင်ပါတယ်။ $ sudo apt-get update $ !!:s/date/grade ဥပမာထဲကအတိုင်းဆိုရင်တော့ ပထမရိုက်ထားတဲ့ sudo apt-get update ဆိုတဲ့ စာသားကို sudo apt-get upgrade ဆိုပြီးပြောင်းပေးသွားမှာပါ။ update ရဲ့ date ဆိုတဲ့ နေရာမှာ grade ဆိုတဲ့ စာသားအစားထိုးပြီး upgrade လို့ ပြင်လိုက်တာပါ။ Calculator Terminal မှာ ပေါင်း၊ နှုတ်၊ မြောက်၊ စား လုပ်ချင်တယ်ဆိုရင်တော့ $ echo $ [( 10 + 10 + 5 ) * 2 ] $ 50 တခြားအသုံးဝင်မယ့် နည်းလမ်းလေးတွေလည်း ဆက်လက်ရေးသားပါဦးမယ်။","tags":"Tips&Trcks","loc":"http://naingyeminn.com/posts/2014/08/03/linux-command-line-usage/","title":"Linux Terminal / Command Line Tricks"},{"text":"$ Terminal မှ User ၏ Command Prompt ကိုဆိုလိုခြင်းဖြစ်သည်။ Online မှ Blog များ Tutorial များတွင် Command များကိုဖော်ပြရာ၌ ထည့်သွင်းဖော်ပြလေ့ရှိသည်။ သို့သော် ထို Command အား ကူးယူ အသုံးပြုရာတွင် ထည့်သွင်းအသုံးပြုစရာမလိုပါ။ $ sudo apt-get update ဟုဖော်ပြထားပါက sudo apt-get update ဆိုသော command သာကူယူအသုံးပြုရန်လိုအပ်သည်။ $ အား စာလုံးတစ်ချို့နှင့် ကပ်၍အသုံးပြုထားပါက shell variable အဖြစ် သတ်မှတ်ထားသည်ကို ပြန်လည်ခေါ်ယူ အသုံးပြုခြင်းဖြစ်သည်။ $ var = \"Hello\" $ echo $var Hello အဆိုပါဥပမာရှိ line တစ်ခုချင်း၏ ရှေ့တွင်တွေ့ရသော $ သည် Command Prompt ကိုဆိုလိုခြင်းဖြစ်ပြီး ဒုတိယ line တွင်ပြထားသော $var သည် shell variable ကိုဆိုလိုခြင်းဖြစ်သည်။ # $ ကဲသို့ပင် Command များ၏ရှေ့တွင် ေဖာ်ပြလေ့ရှိသည်။ root user super user အနေဖြင့် အသုံးပြုထားသော Terminal ၏ Command Prompt ကိုဆိုလိုခြင်းဖြစ်သည်။ သာမန် User Prompt $ မှ Root User Prompt # သို့ ပြောင်းလိုပါက - sudo -s command ဖြင့်ပြောင်းနိုင်သည်။ $ sudo -s [ sudo ] password for user: # ~/ သင်၏ Home Directory ကိုဆိုလိုခြင်းဖြစ်သည်။ တနည်းအားဖြင့် /home/yourname နှင့်တူညီသည်။ $ cd ~/ $ cd /home/yourname ./ Terminal တွင် သင်ရောက်ရှိနေသော လက်ရှိ Directory ကို ဆိုလိုသည်။ Executable file များကို terminal မှတဆင့် run သောအခါတွင်အသုံးပြုလေ့ရှိသည်။ ဥပမာတွင်ပြထားသည်မှာ လက်ရှိ ရောက်ရှိနေသော Directory ထဲမှ script ဆိုသော Executable File ကို run လိုက်ခြင်းဖြစ်သည်။ $ ./script . File သို့မဟုတ် Folder တို့၏ အမည်ရှေ့တွင် . ထည့်ပါက ထို File/Folder သည် File Manager ထဲတွင်သာမန်အားဖြင့် မြင်ရမည်မဟုတ်ပါ။ ထို File/Folder များအား File Manager တွင် မြင်နိုင်စေရန် Control + H Key အား နှိပ်၍ ဖော်နိုင်သည်။ အများအားဖြင့် System Configuration file များ folder များတွင်အသုံးပြုလေ့ရှိသည်။ User ၏ Home Directory ~/ ထဲတွင် .local , .config စသဖြင့်တွေ့နိုင်သည်။ sudo root တနည်းအားဖြင့် super user အနေဖြင့် command များ executable file များအား run သောအခါတွင် သုံးသည်။ Windows တွင် Administrator အနေဖြင့် အသုံးပြုသည်နှင့် တူညီသည်။ Command, Option and Parameter Terminal တွင်း အသုံးပြုသော command များသည် အများအားဖြင့် လက်ရှိရောက်ရှိနေသော Directory နှင့် အတွင်းရှိ File/Folder များတွင်သာ သက်ရောက်သည်။ အထူးထပ်မံဖြည့်စွက်လိုက်သော Options များ Parameter များပေါ်မူတည်၍သာ အပြောင်းအလဲများရှိသည်။ ဥပမာပြရလျှင် ls command သည် လက်ရှိရောက်ရှိနေသော Directory ထဲမှ File/Folder စာရင်းကို ပြပေးသည်။ ls /usr/share ဟူ၍ parameter အနေဖြင့် Directory Path /usr/share ကိုထည့်ပါက ထို Directory ထဲမှ File/Folder များကိုပြပေးမည်ဖြစ်သည်။ Blog များ Tutorial များတွင်ဖော်ပြထားသော Linux Command များအား ကူးယူအသုံးပြုရာတွင် Error များ တက်နိုင်ပါသည်။ အချို့ Command များမှာ မိမိ Install ပြုလုပ်မထားခြင်းကြောင့် ဖြစ်နိုင်သလို ကူယူရာတွင် text format လွဲချော်ခြင်းကြောင့်လဲဖြစ်နိုင်ပါသည်။ Command များသည် အများအားဖြင့် အောက်ပါ format အတိုင်းရှိတတ်ပါသည်။ $ wget -O skype-ubuntu-current_i386.deb http://www.skype.com/go/getskype-linux-beta-ubuntu-32 အဆိုပါစာကြောင်းတွင် wget သည် Internet ရှိ File များအား terminal မှတဆင့် Download ပြုလုပ်ရာတွင်သုံးသော command တစ်ခုဖြစ်သည်။ -O သည် command ၏ Option ဖြစ်သည်။ Download ဆွဲလိုက်သော file အား နာမည်တစ်ခုဖြင့် ပြောင်းလဲစေလိုလျှင်သုံးပါသည်။ -O နောက်တွင်ရှိသော skype-ubuntu-current_i386.deb သည် ပြောင်းလဲလိုသော File နာမည်ဖြစ်ပြီး ၄င်း၏နောက်ရှိ http://www.skype.com/go/getskype-linux-beta-ubuntu-32 သည် Download ပြုလုပ်မည့် File ရှိရာလမ်းကြောင်း (Link) ဖြစ်သည်။ ထို အစိတ်အပိုင်းတစ်ခုစီ၏ ကြားတွင် Space ခြားထားသည်ကို သတိပြုရန်လိုအပ်သည်။ \"wget space -O space skype-ubuntu-current_i386.deb space http://www.skype.com/go/getskype-linux-beta-ubuntu-32\" Command များအသုံးပြုရာတွင် - , -- , နှင့် Space တို့ကို အထူးကရုပြုရမည်ဖြစ်ပြီး လွဲချော်နေပါက ထို Command အလုပ်လုပ်မည်မဟုတ်ပါ။","tags":"Tips&Trcks","loc":"http://naingyeminn.com/posts/2014/07/03/tips-for-ubuntu-mm/","title":"Tips for Ubuntu-MM"},{"text":"ရုံးမှာ တစ်ခါတစ်ခါ Virus ဝင်ထားတဲ့ Flash Drive တွေ ယူယူလာ Data တွေမတွေ့တော့လို့ဆိုပြီး လာပြလေ့ရှိပါတယ်။ များသောအားဖြင့် Windows Virus တွေက Flash Drive ကနေပဲကူးကြတာများပါတယ်။ ကူးပြီဆိုရင်လဲ Drive ထဲရှိတဲ့ Folder တွေကို Hidden လုပ် Folder နဲ့ နာမည်တူ Link တွေထုတ်ပြီး virus file ကိုသွားချိတ်လေ့ရှိပါတယ်။ Windows မှာရှိတဲ့ Antivirus က Virus ကိုရှင်လိုက်နိုင်တယ်ဆိုရင်တောင် အဲဒီ Virus က Hidden လုပ်သွားတဲ့ Flash Drive ထဲက Folder တွေကိုတော့ ပြန်ဖေါ်ပေးလေ့မရှိပါဘူး။ အကယ်၍များ Linux မှာ အဲ့ Drive ကိုသွားသုံးမယ်ဆိုရင်တော့ Hidden ဖြစ်နေတဲ့ Folder တွေကိုမြင်ရပါလိမ့်မယ်။ Drive ထဲ Virus ရှိနေသေးတယ်ဆိုရင်တောင် အဲဒီ Windows က Virus တွေက Linux ပေါ်မှာအလုပ်မလုပ်ပါဘူး။ လိုတာက အဲဒီ Virus ဖိုင်( .exe, .bat) စတာတွေကို ကိုယ်တိုင် delete လုပ်ေပးဖို့ပါပဲ။ နောက်ပြီး Hidden တွေကို ပြန်ေဖာ်တာ virus ကလုပ်သွားတဲ့ Shortcut (.lnk) File တွေကိုပြန်ဖျက်တာတွေ လုပ်ပေးရပါတယ်။ ဒါပေမယ့် Windows File System အရ Hidden လုပ်ထားတဲ့ Folder တွေကို ပြန်ဖော်ပေးဖို့အတွက် Ubuntu မှာတော့ package တချို့ ထပ်တင်ရပါတယ်။ နောက်ပြီး Terminal ကနေ command နဲ့ Folder တွေတစ်ခုချင်း လိုက်ပြီး Hidden attribute လိုက်ဖြုတ်ပေးရပါတယ်။ Windows ပေါ်မှာ တော့ cmd ထဲဝင် \"attrib -s -h folder_name\" ဆိုပြီး ပြန်ေဖာ်ပေးလို့ ရပါတယ်။ ခက်တာက Folder အရမ်းများတာ၊ Sub-Folder တွေပါ Hidden ဖြစ်နေတာဆိုရင် ပြန်ေဖာ်ရတာ လက်ဝင်ပါတယ်။ Windows မှာ Batch တို့ VBScript တို့သုံးပြီး ဒီပြဿနာကို ရှင်းလို့ ရကောင်းရနိုင်ပါလိမ့်မယ်။ ဒါပေမယ့် Linux ပဲသုံးတဲ့သူတွေအတွက်တော့ အခုလို Virus ပြဿနာအတွက် အကူအညီလာတောင်းရင် အလွယ်တကူ ရှင်းပေးနိုင်အောင် ရည်ရွယ်ပြီး ဒီ Script လေးရေးဖြစ်သွားတာပါ။ ကိုယ်တိုင်လဲ အမြဲကြုံနေရတော့ command တွေအခါခါရိုက်ပြီး ရှင်းပေးနေရာတာ အချိန်ကုန်တာကြောင့်လဲ ပါပါတယ်။ Ubuntu မှာ vFix ကို သုံးဖို့ attr နဲ့ fatattr ဆိုတဲ့ package တွေလိုပါတယ်။ vFix install လုပ်တဲ့အချိန် တပါတည်း install လုပ်သွားပါလိမ့်မယ်။ အဲဒီအတွက် internet connection ရှိနေဖို့တော့လိုပါတယ်။ Install လုပ်ဖို့ အတွက် vFix zip file ကို Download လုပ်ပါ။ $ wget https://github.com/naingyeminn/vFix/archive/master.zip -O vFix.zip ရလာတဲ့ vFix.zip ကို extract လုပ်ပါ။ $ unzip vFix.zip Extract လုပ်ထားတဲ့ Directory ထဲ ကို Terminal ကနေဝင်ပါ။ $ cd vFix-master နောက်ဆုံးအနေနဲ့ make command ကို root permission နဲ့ run ပေးရုံပါပဲ။ $ sudo make သုံးပုံ သုံးနည်းကတော့ Fix လုပ်ချင်တဲ့ Flash Drive ကို တပ်ပြီး mount လုပ်လိုက်ပါ။ ပြီးရင်တော့ vfix ဆိုတဲ့ command နဲ့သုံးပြီး fix လုပ်ရုံပါပဲ။ $ vfix /media/your_mounted_drive/ Or $ cd /media/your_mounted_drive/ $ vfix your_mounted_drive ဆိုတဲ့နေရာမှာက ကိုယ့် drive ရဲ့ name ကိုထည့်ရမှာပါ။ ပြန်ပြောရရင် ဒီ script က drive ထဲမှာရှိသမျှ folder တွေကို Hidden Attribute ဖြုတ်ပေးသွားမယ့်အပြင် မလိုအပ်တဲ့ .lnk file တွေ, autorun.inf နဲ့ RECYCLER folder တို့ကို ဖျက်ပေးသွားမှာပါ။ ဒါကြောင့် မိတ်ဆွေ သူငယ်ချင်း တစ်ယောက်ယောက်က သူ့ Flash Drive ကို virus ဝင်ထားလို့ folder တွေ ပျောက်နေတယ် ဆိုရင် ကိုယ့်ရဲ့ Ubuntu Linux မှာ ဒီ script လေးသုံးပြီး အလွယ်တကူ ဖြေရှင်းပေးနိုင်ပါကြောင်း မျှဝေလိုက်ရပါတယ်။ vFix on GitHub","tags":"Tips&Trcks","loc":"http://naingyeminn.com/posts/2014/06/23/vfix-fix-virus-infected-flash-drives/","title":"vFix - Fix Virus Infected Flash Drives"},{"text":"မနေ့က အလုပ်မှာ Desktop တစ်လုံးအပိုထွက်လာတာနဲ့ XenServer စမ်းကြည့်ဖြစ်တယ်။ စက်က အမြင့်ကြီးမဟုတ်ပေမယ့် processor က VT support လုပ်တာရယ် Memory 4GB လောက်ရှိတာရယ်ကြောင့် စမ်းဖို့အဆင်ပြေသွာတယ်။ XenServer 6.2 iso လဲဆွဲထားပြီးသားရှိပေမယ့် CD အလွတ်မရှိတာနဲ့ Flash Drive နဲ့ပဲ install လုပ်မယ်ေပါ့။ အဲ့ဒီအတွက် flash drive ကို FAT32 နဲ့ format ချ၊ Unetbootin နဲ့ ပုံမှန်အတိုင်းပဲ XenServer ISO ကို extract လုပ်လိုက်တာ ဖြစ်ချင်တော့ boot တက်တဲ့အချိန်မှာ kernel ရှာမရပါဘူးဆိုပြီး error ပြလာတယ်။ google မှာရှာကြည့်လိုက်တော့ USB drive ရဲ့ /boot/isolinux/ directory ထဲက isolinux.cfg ကို syslinux.cfg ဆိုပြီး တော့ရယ်၊ /boot/ ထဲက isolinux ကို syslinux ဆိုပြီး ပြောင်းပေးရတယ်။ ေနာက် /syslinux.cfg ကိုဖျက်ပေးရတယ်။ $ mv /media/flashdrive/boot/isolinux/isolinux.cfg /media/flashdrive/boot/isolinux/syslinux.cfg $ mv /media/flashdrive/boot/isolinux /media/flashdrive/boot/syslinux $ rm /media/flashdrive/syslinux.cfg အဲဒါလေးလုပ်ပေးလိုက်တော့ boot တက်ပြီး Install လုပ်လို့ရသွားတယ်။ အောက်ကပုံကတော့ VMware Player ပေါ်မှာ install လုပ်ပြထားတာပါ။ နောက်တစ်ခုအနေနဲ့ XenServer ကို manage လုပ်ဖို့အတွက် XenCenter လိုပါတယ်။ XenCenter က Windows installer ပဲရှိပြီး Linux မှာတော့ အစားထိုးသုံးစရာအနေနဲ့ OpenXenManager ဆိုတာရှိပါတယ်။ Ubuntu user တွေအတွက်ကတော့ Software Center ကနေ install လုပ်နိုင်ပါတယ်။ $ sudo apt-get install openxenmanager OpenXenManager က install လုပ်ပြီးရင် application list ထဲမဝင်ပါဘူး။ Terminal ကနေ ဒါမှမဟုတ် Ubuntu ရဲ့ Command Box (Alt+F2) ကနေ \"openxenmanager\" ဆိုပြီး run ရပါတယ်။ အဲ့လိုမှမဟုတ်ရင်လဲ $ sudo wget https://dl.dropboxusercontent.com/u/26716001/Ubuntu/openxenmanager.desktop -P /usr/share/applications/ ဆိုတဲ့ command နဲ့ Application Shortcut ကို Terminal ကနေလှမ်းယူနိုင်ပါတယ်။ XenCenter ကိုမစမ်းဖူးသေးလို့ ဘယ်လို error တွေရှိနိုင်ဆိုတာမသိပေမယ့် OpenXenManager(OXM) မှာတော့ VM create လုပ်လိုက်တဲ့အချိန် တစ်ခါတစ်ခါကျ list ထဲပေါ်မလာတာဖြစ်တတ်တယ်။ အဲဒီအတွက် OXM မှာ XenServer ကို Disconnect လုပ်ပြီး Connect ပြန်လုပ်လိုက်ရင်တော့ ေပါ်လာပါတယ်။ နောက်တစ်ခုကြုံရတာက VM မှာ install လုပ်ဖို့ OS တွေကို iso ဖိုင်အနေနဲ့ ssh နဲ့ဝင်ပြီး XenServer ထဲကူးထည့်လိုက်မိတယ်။ XenServer install လုပ်ချိန်တုန်းက Default အတိုင်းပဲ Partition ပိုင်းခိုင်းလိုက်တော့ Host ရဲ့ root partition size က တော်တော်သေးနေတော့ ထည့်လိုက်တဲ့ iso တွေနဲ့ပြည့်သွားတော့ Reboot လုပ်လိုက်တဲ့အချိန်ကျ XenServer XAPI Service ကို Start လုပ်မရပါဘူးဆိုတဲ့ Error ပြလာတယ်။ Network လဲမရတော့ဘူး။ ရှာဖတ်ကြည့်တော့မှ Space မလောက်ရင်ဖြစ်တတ်တယ်ဆိုတာတွေ့တာနဲ့ Server ရဲ့ Shell ကနေပဲထည့်ထားတဲ့ iso တွေပြန်ဖျက်ပြီး Reboot ထပ်လုပ်လိုက်မှ ပြန်အဆင်ပြေသွားတယ်။ VM create လုပ်ပြီး Windows Server 2008 ကို Install လုပ်ကြည့်တာတော့ အဆင်ပြေပြေချောချောမွေ့မွေ့ပါပဲ။ တစ်ခုရှိတာက Install လုပ်ပြီးပြီးချင်း XenServer ကနေ Performance ကိုကြည့်ရင် CPU Usage ပဲမြင်ရပြီး Memory Usage ကိုတော့ xs-tools (XenServer Tools) ကိုတင်ပေးပြီးမှ မြင်ရတယ်။ xs-tools က XenServer ရဲ့ LocalStorage ထဲမှာ iso အနေနဲ့ ပါပြီးသားပါ။ VM ရဲ့ Optical Drive ထဲ အဲဒီ iso mount လုပ်ပြီး VM ထဲက CD-ROM ကနေပဲ install လုပ်ပေးလိုက်ရုံပါပဲ။ Windows VM မှာ တင်ရင်တော့ DotNet Framework 4.0 လိုပါလိမ့်မယ်။ အဲဒါလဲ xs-tools iso ထဲမှာပဲရှိပါတယ်။ XenServer က အလျှင်ကတော့ Free အပြင် Enterprise, Platinum ဆိုပြီး Commercial Version တွေခွဲထုတ်ခဲ့ပေမယ့် XenServer 6.2 ကိုတော့ Open Source အနေနဲ့ပြောင်းလိုက်ပြီး Supporting Service ကိုပဲ Commercial အနေနဲ့ လုပ်လိုက်ပါပြီ။ Virtualization ကိုလေ့လာချင်သူတွေအတွက် VMware ရဲ့ ESXi အပြင် တခြားရွေးချယ်စရာတစ်ခုအနေနဲ့ XenServer ကို သုံးလို့တော့ရပါတယ်။ ဒါပေမယ့် ပုံမှန် Desktop တစ်လုံးနဲ့စမ်းတာကတော့ Virtualization ဆိုတာ ဘယ်လိုရှိတယ် VM တွေ ဘယ်လိုလုပ်လို့ရတယ်ဆိုတာလောက်ပဲသိနိုင်မှာပါ။ လုပ်ငန်းခွင်မှာ အသုံးချနေရတာမဟုတ်ဘူးဆိုရင်တော့ ကိုယ်ပိုင် Lab တစ်ခု ကောင်းကောင်းတည်ဆောက်နိုင်မှသာ အသေးစိပ်လေ့လာနိုင်လိမ့်မယ်လို့သာ ယူဆမိပါတယ်။ Related References: Install XenServer via USB Flash Drive Citrix XenServer Core Feature Matrix XenServer Open Source Virtualization Features XenServer Documentation","tags":"Review","loc":"http://naingyeminn.com/posts/2014/05/30/xenserver-installation-problems-and-review/","title":"XenServer Installation Problems and Review"},{"text":"Zawgyi နဲ့ Unicode အင်အားပြိုင်နေတာကြာပါပြီ Zawgyi က web မှာ တစ်နည်းအားဖြင့် internet ပေါ်မှာ အချိန်အတန်သင့် နေရာယူပြီးချိန်မှ Unicode ကပေါ်လာခဲ့လေတော့ သာမန် User အသိုင်းအဝန်းထဲကို Unicode ကမတိုးနိုင်ဖြစ်နေခဲ့တာလဲ အချိန်မနည်းတော့ပါဘူး။ အဓိကက Unicode ရဲ့ အကျိုးကျေးဇူးကိုမသိတဲ့အတွက် အလွယ်တကူသုံးနိုင်ပြီး တွင်ကျယ်နေပြီဖြစ်တဲ့ Zawgyi ကိုပဲဆက်သုံးဖြစ်နေကြတာပါ။ သိတဲ့သူဆိုတာကလဲ IT သမား အသိုင်းအဝန်းထဲကမှ Developer တွေလောက်သာရှိတော့ အခုချိန်ထိကို မတွင်ကျယ်ဖြစ်နေရတယ်။ အထူးသဖြင့် Facebook နဲ့ Gtalk တို့မှာက Zawgyi ပဲသုံးကြတာပါ။ လူအနည်းစုနဲ့ အများစု ယှဉ်လိုက်တော့ အပေါင်းအသင်းတွေထဲ ကိုယ်ပဲ Unicode သုံးပြီး သူရေးတာကိုယ်မဖတ်နိုင် ကိုယ်ရေးတာသူမဖတ်နိုင်နဲ့ နောက်ဆုံး မထူးဇာတ်ခင်းပြီး Zawgyi ပဲပြန်သုံးဖြစ်ကြတာများတယ်။ ကိုယ်တိုင်လဲ အဲဒီလို ခဏခဏဖြစ်တယ်။ နောက်ဆုံး ဆုံးဖြတ်ချက်ချလိုက်တယ်။ ပုံမှန်သုံးရင် Unicode သုံးပြီး Facebook နဲ့ gtalk မှာတော့ လိုအပ်မှ Zawgyi ကိုသုံးမယ်ပေါ့။ ဒါနဲ့ပဲ သုံးနေကျဖြစ်တဲ့ Ubuntu မှာ အဆင်အပြေဆုံးဖြစ်မယ့် နည်းလမ်းတွေရှာဖြစ်ခဲ့တယ်။ Ubuntu မှာ Zawgyi နဲ့ Unicode Font နှစ်မျိုးလုံးထည့်လိုက်ရင် ဇော်ဂျီနဲ့ပဲ ပေါ်တော့တယ်။ ဘာကြောင့်ရယ် အတိအကျမပြောနိုင်ပေမယ့် Zawgyi Font မှာက Code Point ပိုများနေတဲ့အတွက် Zawgyi ကိုပဲ Default အဖြစ် သတ်မှတ်သွားတာလို့ပဲယူဆတယ်။ ဒါကြောင့် Unicode ကိုပဲ Default အနေနဲ့သုံးချင်တယ်ဆိုရင် Fallback Font ကိုပြောင်းပေးရတယ်။ အဲဒီအတွက် လွယ်အောင် my-fs-cli ဆိုတဲ့ command line tools လေးတစ်ခုရေးဖြစ်တယ်။ Ubuntu 12.04 LTS ပေါ်မှာ Build လုပ်ပြီး Launchpad မှာ တင်ပေးထားပေမယ့် Update မလုပ်ဖြစ်တော့ နောက်ထွက်တဲ့ Ubuntu version အသစ်တွေမှာ ppa သုံးပြီး package manager တွေကနေ install လုပ်လို့မရတော့ဘူး။ သုံးချင်ရင် .deb file download ဆွဲပြီး Manually install လုပ်မှရတယ်။ ပေးထားတဲ့ Command အတိုင်း Terminal ထဲမှာ တစ်ကြောင်းချင်းရိုက်ထည့်လိုက်ရုံပါပဲ။ wget https://dl.dropboxusercontent.com/u/26716001/Ubuntu/my-fs-cli_12.07.1_all.deb sudo dpkg -i my-fs-cli_12.07.1_all.deb သုံးပုံကတော့ my-fs-cli ဆိုတဲ့ command ကို terminal မှာ run ပေးရုံပါ။ တစ်ကြိမ်ရိုက်ရင် Zawgyi နောက်တစ်ကြိမ်ရိုက်ရင် Unicode ဆိုပြီး တစ်လှည့်စီပြောင်းပေးပါတယ်။ ပထမဉီးဆုံးအကြိမ် run တာဆိုရင်တော့ system changes တွေ affect ဖြစ်ဖို့ Logout လုပ်ပြီး Login ပြန်ဝင်ပေးဖို့တော့ လိုပါမယ်။ Fallback Font ကို Unicode အနေနဲ့ပြောင်းလိုက်ပြီဆိုရင် System တစ်ခုလုံး Unicode နဲ့ ဖြစ်သွားမှာပါ။ Browser မှာ Facebook ကိုဝင်လိုက်ရင် Zawgyi နဲ့ ရေးထားသမျှ စာတွေအကုန်လုံးဖတ်မရတော့ဘူးဖြစ်သွားပါလိမ့်မယ်။ Zawgyi အနေနဲ့ဖတ်လို့ရဖို့ ကိုထိန်လင်းရွေ (saturngod) လုပ်ပေးထားတဲ့ bookmarklets ကိုသုံးပြီး ဖတ်လို့ရပါတယ်။ Firefox Version အဟောင်းတွေမှာတော့ Unicode to Zawgyi, Zawgyi to Unicode, MM Font Tagger စတာတွေသုံးလို့ရပေမယ့် အခုနောက်ပိုင်း version တွေမှာတော့ Zawgyi Force, Unicode Force ၂မျိုးပဲသုံးလို့ရပါလိမ့်မယ်။ သုံးပုံသုံးနည်းကတော့ ပေးထားတဲ့ link မှာပါပြီးသားပါ။ နောက်ထပ်တစ်ခုက clip-text-convert ဆိုတဲ့ package လေးပါ။ သူငယ်ချင်း သူရလှိုင် ရေးထားတဲ့ Python-Myanmar ဆိုတဲ့ python module ကိုသုံးပြီး text တွေကို zawgyi, unicode အလွယ်တကူပြောင်းနိုင်အောင် လုပ်ပေးထားတာပါ။ Unicode သုံးနေတော့ zawgyi နဲ့ ရေးထားတဲ့ စာသားတွေကို အလွယ်တကူပြောင်းနိုင်အောင်လို့ပါ။ ဥပမာအနေနဲ့ zawgyi နဲ့မြန်မာလိုရေးပြီး နာမည်ပေးထားတဲ့ file တစ်ခုကို Unicode ပြောင်းချင်တဲ့အခါ Rename လုပ်ပြီး ကိုယ်တိုင်ပြန်ရိုက်ရပါလိမ့်မယ်။ အဲဒီအတွက် Clip-Text-Convert ကိုသုံးပြီးဖြေရှင်းနိုင်ပါတယ်။ အဓိက လုပ်ဆောင်ပေးတာကတော့ စာသားတစ်ခုခုကို copy ဒါမှမဟုတ် cut လုပ်လိုက်လို့ ရောက်သွားတဲ့ Clipboard ထဲကစာသားကို Zawgyi, Unicode စသဖြင့်ပြောင်းပေးပါတယ်။ Paste ပြန်လုပ်လိုက်တဲ့အခါကျ Convert လုပ်ထားပြီးသားစာသားပြန်ထွက်လာမှာပါ။ wget https://python-myanmar.googlecode.com/files/python-myanmar_0.0.2-0_all.deb sudo dpkg -i python-myanmar_0.0.2-0_all.deb ဆိုတဲ့ command ၂ကြောင်းကိုရိုက်ပြီး Python Myanmar ကိုသွင်းပါ။ wget https://github.com/naingyeminn/clip-text-convert/archive/master.zip unzip master.zip cd clip-text-convert-master make install Clip-Text-Convert ကိုသွင်းလိုက်ရင် conv2zg , conv2uni , noticonv နဲ့ noticlip ဆိုတဲ့ command လေးတွေ သုံးလို့ရသွားပါလိမ့်မယ်။ conv2zg က copy ကူးလိုက်တဲ့ Unicode Text တွေကို Zawgyi အနေနဲ့ Convert လုပ်ပြီး clipboard ထဲပြန်ထည့်ပေးပါတယ်။ Unicode နဲ့ရိုက်ထားတဲ့ စာသားကို select လုပ် copy ကူးပြီး conv2zg ဆိုတဲ့ command ကို run လိုက်ပြီး Paste ပြန်လုပ်လိုက်တာနဲ့ Zawgyi နဲ့ရေးထားတဲ့ စာသားပြန်ထွက်လာမှာပါ။ command ကို terminal မှာသွား run စရာမလိုအောင် Video ထဲမှာပါတဲ့အတိုင်း shortcut key သတ်မှတ်ထားနိုင်ပါတယ်။ conv2uni လဲ conv2zg လိုပါပဲ။ သူကတော့ Unicode အနေနဲ့ပြောင်းပေးတာပါ။ noticonv ကတော့ Pidgin User တွေအတွက်ပါ။ Ubuntu မှာ Gtalk ကို Pidgin နဲ့ပြောတဲ့အခါ ပြောနေတဲ့ conversation တွေထဲကမှ နောက်ဆုံးပြောလိုက်တဲ့ message ကို Unicode အနေနဲ့ပြောင်းပြီး notification မှာပြပေးတာပါ။ နောက်ဆုံးတစ်ခုဖြစ်တဲ့ noticlip ကတော့ ကူးယူလိုက်တဲ့ စာသား (Text ) တွေကို Unicode ပြောင်းပြီး Notification မှာပြပေးပါတယ်။ Setting ချပုံနဲ့ အသုံးပြုပုံကိုတော့ ပေးထားတဲ့ YouTube Video မှာကြည့်လိုက်ပါ။ ပြထားတဲ့အတိုင်း convert လုပ်လို့မရရင် xclip ဆိုတဲ့ package လေးသွင်းပေးဖို့လိုနေတာပါ။ \" sudo apt-get install xclip \" ဆိုတဲ့ command သုံးပြီး install လုပ်ပေးနိုင်ပါတယ်။ မှတ်ချက် ။ ။ အခုနည်းလမ်းတွေက Ubuntu 12.04 LTS မှာစမ်းထားတဲ့ နည်းလမ်းတွေပါ။ လက်ရှိသုံးနေတဲ့ 12.04 ကို Based လုပ်ထားတဲ့ ElementaryOS Luna မှာလဲအဆင်ပြေပါတယ်။ အသစ်ထွက်နေပြီဖြစ်တဲ့ Ubuntu 14.04 LTS မှာတော့ မစမ်းကြည့်ရသေးပါဘူး။","tags":"Ubuntu","loc":"http://naingyeminn.com/posts/2014/04/25/myanmar-unicode-in-ubuntu/","title":"Ubuntu မှာ Unicode သုံးမယ်ဆိုရင်"},{"text":"အရင်းက blog လေးတစ်ခုလုပ်ပြီး ubuntu အကြောင်းလေးတွေတော်တော်များများ ရေးခဲ့ဖူးပေမယ့် အဲဒီ blog လေးပျက်သွားပြီးကတည်းက ဆက်မရေးဖြစ်တော့တာ တော်တော်ကြာပါပြီ။ ကြားထဲမှာတော့ အသစ်ရထားတဲ့ blog လေးမှာ တစ် post နှစ် post လောက်တော့တင်ဖြစ်တယ်။ အဲ့နောက်ပိုင်းဆက် မရေးဖြစ်တော့ပြန်ဘူး။ အကြောင်းက ရထားတဲ့ blog က wordpress နဲ့ ဆိုပေမယ့် ပြင်ချင်တိုင်းပြင်ဖို့ admin right မရှိတဲ့အတွက် စိတ်ကြိုက် theme ပြောင်းမရတာရယ် နောက်ပြီး unicode နဲ့ရေးတော့ font မရှိလဲ လူတိုင်းဖတ်နိုင်အောင် font embed လုပ်ဖို့ CSS ဝင်ပြင်လို့မရတာတွေရယ်ကတော့ အဓိကပေါ့။ နောက်တစ်ခုက ကိုယ်က ရေးချင်တာကို text editor မှာရေးပြီး online ပြန်တင်ဖို့ကျ format ပြန်ချိန်ရတာကလဲရှိသေးတယ်။ backup ရှိနေဖို့ကိုလဲ တကူးတကာ့ ပြန်သိမ်းနေရတာနဲ့ဆိုတော့ အလုပ်ကရှုပ်တယ်။ ဒီလိုပဲ အကြောင်းအမျိုးမျိုးပြပြီး မရေးဖြစ်တာကြာပါပြီ။ မနေ့ကမှ အကြံတစ်ခုပေါ်လာတာနဲ့ blog အသစ်တစ်ခုလုပ်ဖို့ ဆုံးဖြတ်လိုက်တယ်။ Internet ဟိုဒီရှာရင်း တွေ့လိုက်တဲ့ Ghost ဆိုတဲ့ blogging platform ကိုစမ်းရာကနေ Markdown format နဲ့ ရေးတဲ့ idea ကို အရမ်းသဘောကျသွားတယ်။ ဒါနဲ့ပဲ markdown နဲ့ရေးလို့ရနိုင်တာလေးတွေရှာကြည့်မိတယ်။ Octopress ကိုသူငယ်ချင်းတစ်ယောက် သုံးထားတာတွေ့လို့ စမ်းဖို့ကြည့်တော့ Ruby နဲ့ရေးထားတဲ့ Static Page Generator ဆိုတာကိုတွေ့လိုက်ရတယ်။ ကိုယ်ရေးထားတဲ့ markdown file တွေကို ကိုယ်စိတ်ကြိုက်ပြင်ထားတဲ့ HTML/CSS/JavaScript file တွေနဲ့ Static Page (.html) file လေးတွေထုတ်ပေးတာပါ။ အဲဒါစမ်းဖို့အတွက်ကို Package တွေထပ်သွင်းရမှာဆိုတော့ Ruby အစား ကိုယ်နည်းနည်းပါးပါးသိတဲ့ Python နဲ့များရှိလေမလားဆိုပြီးရှာကြည့်ရင်း Pelican ကိုသွားတွေ့တယ်။ Ubuntu သုံးနေတာဖြစ်တဲ့အတွက် Python ကပါပြီးသားဆိုတော့ လိုအပ်တာလေးနည်းနည်းထပ်ဖြည့်လိုက်တာနဲ့ Pelican ကိုစမ်းလို့ရပြီလေ။ လိုချင်တဲ့ Theme ကို ပြင်ဆင်ပြီးပြီဆိုတာနဲ့ သတ်မှတ်ထားတဲ့ location ထဲမှာ Markdown file လေးတွေရေးထည့်ပြီး command လေးရိုက်လိုက်တာနဲ့ ကိုယ်ပြင်ထားတဲ့အတိုင်း .html ဖိုင်လေးတွေထွက်လာရော။ တော်တော်သဘောကျသွားတယ်။ နောက်ပြီ တစ်ခုသိထားတာက Dropbox မှာ HTML/CSS/JavaScript file တွေထည့်ပြီး dropbox public link နဲ့ပြန်ခေါ်ရင် ရတယ်ဆိုတာပါ။ အဲဒီတော့ အခုအတိုင်း Static Page လေးတွေ အလွယ်တကူရေးလို့ရတဲ့အပြင် Dropbox ကိုလဲ hosting တစ်ခုလိုသာသုံးလို့ရမယ်ဆိုရင် အဆင်ပြေလောက်မယ်ထင်တာနဲ့ Dropbox အသုံးချပုံတွေကိုရှာကြည့်ဖြစ်တယ်။ KISSr လို dropbox နဲ့ ချိတ်ဆက်ပြီး အသုံးပြုလို့ရတဲ့ service သုံးလေးငါးခုလောက်ရှာတွေ့တယ်။ kissr ကတော့ အရိုးရှင်းဆုံးနဲ့ သုံးရအလွယ်ဆုံးဖြစ်မယ်ထင်တာပဲ။ နောက်ပြီး subdomain ယူပြီးသုံးနိုင်တဲ့အပြင် domain name ကလဲ မှတ်ရလွယ်တော့ သုံးမယ်ဆို သုံးလို့အဆင်ပြေပါတယ်။ နောက်တစ်ခုကတော့ github ကိုသုံးပြီး host လုပ်တဲ့နည်းပါ။ Dropbox ကိုသုံးတာက ပိုပြီး လွယ်ကူရှင်းလင်းပေမယ့် github ကိုသုံးလေ့ရှိသူတွေအတွက်ကတော့ ကိုယ့် github မှာပဲ repo ဆောက်ပြီး host လုပ်တာက ပိုကောင်းပါတယ်။ ဘာကြောင့်လဲဆိုတော့ github က ကိုယ်ပိုင် domain နဲ့ ချိတ်ဆက်အသုံးပြုလို့ရအောင် DNS point လုပ်ဖို့ ip နဲ့ လုပ်ပုံလုပ်နည်းတွေကို အသေစိပ်ရေးပေးထားလို့ပါပဲ။ ဒါပေမယ့် Github ကတော့ host လုပ်ဖို့ repository ကို 1GB အထိပဲအမျာဆုံးသုံးနိုင်ပါတယ်။ ပုံမှန် static page လေးတွေ Host လုပ်ဖို့အတွက်လောက်ကတော့ 1GB ဆိုတဲ့ ပမာဏက မနည်းလှပါဘူး။ ဓာတ်ပုံ၊ video၊ audio တွေကို ကိုယ့် post မှာထည့်ချင်တယ်ဆိုရင်တော့ တခြား Dropbox လို youtube လို service တွေမှာ တင်ပြီး link ပြန်လုပ်သုံးမယ်ဆိုရင် Github ကပေးတဲ့ 1GB ဆိုတဲ့ပမာဏက လုံလောက်မှာပါ။ အခုတော့ github ကိုပဲ သုံးဖို့ ရွေးလိုက်ပါတယ်။","tags":"Review","loc":"http://naingyeminn.com/posts/2014/04/12/pelican-and-me/","title":"Pelican နှင့် ကျွန်တော်"},{"text":"လက်ရှိ Laptop မှာ Ubuntu 12.04 LTS ပဲသုံးနေခဲ့တာ တော်တော်ကြာနေပါပြီ။ ကြားထဲမှာ 12.10, 13.04 နဲ့ 13.10 version သုံးခုတောင်ထွက်ခဲ့သည့်တိုင်အောင်မပြောင်းသေးပဲ Stable ဖြစ်တဲ့ LTS ကိုပဲဆက်သုံးဖြစ်နေတာပါ။ အခု လာမယ့် April ဆိုရင် နောက်ထပ် LTS version အသစ်တစ်ခုဖြစ်တဲ့ 14.04 ထပ်ထွက်တော့မှာဖြစ်တဲ့အတွက် version အသစ်ကိုမပြောင်းခင် တခြား distro လေးတွေပြောင်းစမ်းဖို့စိတ်ကူးမိတာနဲ့ပဲ နောက်ဆုံး ဒီ Elementary OS လေး စမ်းကြည့်ဖို့ ရွေးလိုက်ပါတယ်။ Elementary OS က ubuntu-based distro တစ်ခုပါပဲ။ Ubuntu ကိုအခြေခံပြီး မွမ်းမံထားတဲ့ OS တစ်ခုပါ။ သူ့ကို eOS လို့ အတိုကောက်ခေါ်ကြလေ့ရှိပါတယ်။ အခုစမ်းကြည့်ရသလောက်တော့ တော်တော်လေးကို ရိုးရှင်းပြီး အသုံးပြုရလွယ်ကူတာတွေ့ရပါတယ်။ သုံးကြည့်ရသလောက်တော့ အပြည့်အဝပြည့်စုံကောင်းမွန်တဲ့ OS တစ်ခုလို့မဆိုနိုငေ်ပမယ့် အတိုင်းအတာတစ်ခုထိ စိတ်ကြေနပ်စရာကောင်းတဲ့ OS လေးတစ်ခုဖြစ်တယ်လို့တော့ဆိုချင်ပါတယ်။ ထူးခြားချက်လေးတွေ၊ အားသာချက်လေးတွေရှိသလို အားနည်းချက်လေးတွေလဲရှိပါတယ်။ User Interface အနေနဲ့ တော်တော်လေးကိုရိုးရှင်းပြီး သပ်ရပ်ပါတယ်။ Pantheon ဆိုတဲ့ Desktop Environment ကိုသုံးထားတာပါ။ Window, Menu, dialog box ပုံစံတွေ ကတော့ Gnome3 နဲ့ဆင်တူပါတယ်။ File Manager အနေနဲ့ကတော့ Ubuntu မှာလို Nautilus မဟုတ်တော့ပဲ Pantheon-Files ဖြစ်သွားပါတယ်။ Nautilus ကိုယှဉ်နိုင်လောက်အောင် feature မစုံသေးပေမယ့် အသုံးပြုရတာတော့ရိုးရှင်းလွယ်ကူပါတယ်။ ဒါပေမယ့် Nautilus မှာလို Folder Share ဖို့ Sharing Options မပါပါဘူး။ ဒါကြောင့် Network ကနေ File တွေ Share လုပ်ချင်တဲ့အခါ Samba သွင်းပြီး manually configure လုပ်ပေးရပါတယ်။ အဲလိုမှမဟုတ်ရင်တော့ Nautilus ထပ်တင်ပြီးသုံးလို့ရပါတယ်။ Installation ပြီးပြီးချင်းမှာ ပြဿနာရှိတာက Power Consumption ပါ။ Desktop တစ်လုံးမှာ တင်ပြီးသုံးမယ်ဆိုရင်ပြဿနာမရှိပေမယ့် Laptop အနေနဲ့ကတော့ အားနည်းချက်တစ်ခုလို့ဆိုရမှာပါ။ Ubuntu မှာ ၅နာရီဝန်းကျင်လောက် Battery နဲ့သုံးလို့ရပေမယ့် သူမှာတော့ ၂နာရီခွဲ သုံးနာရီလောက်ပဲသုံးလို့ရပါတယ်။ ဒါပေမယ့် application တချို့သုံးပြီး tweak လုပ်လိုက်မယ်ဆိုရင်တော့ ၎နာရီ ၎နာရီခွဲလောက်သုံးလို့ရသွားမှာပါ။ နောက်တစ်ချက်က Application ပိုင်းပါ။ သူ့မှာ Ubuntu လို Office Suite ပါမလာပါဘူး။ LibreOffice ပြန်တင်ပေးရပါတယ်။ Email Client အနေနဲ့ကတော့ Geary Mail ဆိုတဲ့ application လေးပါပါတယ်။ ဒါပေမယ့် သူ့မှာက IMAP နဲ့ SMTP ပဲ support လုပ်တာပါ။ POP3 သုံးလို့မရပါဘူး။ POP3 သုံးချင်ရင်တော့ Thunderbird၊ ဒါမှမဟုတ် Evolution တစ်ခုခုထပ်တင်ပြီးသုံးရပါလိမ့်မယ်။ Default Web Browser ကတော့ Midori ပါ။ သုံးရအဆင်ပြေတယ်ဆိုပေမယ့် Firefox တို့ Chrome တို့မှာလို Plug-ins စုံစုံလင်လင်မရှိတဲ့အတွက် သုံးနေကျ Browser တစ်ခုခု ထပ်တင်တာပိုကောင်းပါလိမ့်မယ်။ Ubuntu နဲ့ ကွာခြားတာက သူ့မှာ Ubuntu လို Application စုံစုံလင်လင်မပါတာပါပဲ။ Disk Utility, System Monitor, Remote Desktop Client, Transmission BitTorrent Client တို့လို ရှိသင့်တဲ့ Application တွေမပါပါဘူး။ ထပ်တင်ဖို့လိုပါတယ်။ အဲဒီအတွက် အသေးစိပ် ဆက်လကေ်ဖာ်ပြပေးပါဦးမယ်။","tags":"Review","loc":"http://naingyeminn.com/posts/2014/04/11/elementary-os-review-1/","title":"Elementary OS - Review (1)"},{"text":"mm-kb.deb ဆိုတဲ့ ဖိုင်လေးကို ပြန်ပြင်ထားတာပါ။ Ubuntu မှာက အခုနောက်ပိုက် deb ဖိုင်တွေကို အရင်လို double click နှိပ်ပြီး install တမ်းလုပ်လို့အဆင်မပြေတော့ပါဘူး။ အဲ့လိုသွင်းလို့ရဖို့ gDebi ဆိုတာထပ်သွင်းရပါတယ်။ အဲဒါမသွင်းချင်ရင် terminal ကနေ dpkg command နဲ့ သွင်းရပါတယ်။ နောက်ပြီး mm-kb.deb ဖိုင်ကိုသွင်းပြီးရင် IBus ကို run ပေးရတာ input method သွားရွေးပြီးထည့်ပေးရတာ၊ Input Method ကို default xkb အစား IBus သုံးမယ်ဆိုတာတွေကို manually configure လုပ်ပေးရပါတယ်။ အခုဒီ installation script လေးမှာတော့ အဲဒါတွေကို auto လုပ်ပေးသွားမှာပါ။ နောက်ပြီး ယူနီကုတ်၊ ဇော်ဂျီ ကြိုက်ရာ ၂မျိုးစလုံး တစ်ခါတည်းတမ်းတင်နိုင်သလို တစ်ခုဆီလဲ ရွေးပြီးတင်လို့ရပါတယ်။ Bash script ကိုပဲ Zenity သုံးပြီး GUI လေးနဲ့ install လုပ်လို့ရအောင်လုပ်ပေးထားတာပါ။ အရင်ကဆို install လုပ်ပုံလုပ်နည်းတွေကို အရှည်ကြီး ရှင်းပြနေရတဲ့အပြင် သာမာန် user တွေအတွက် ရှုပ်ထွေးတယ်လို့ထင်ကောင်းထင်ပါလိမ့်မယ်။ အခုတော့ ကျွန်တော် တတ်နိုင်သမျှ အလွယ်ဆုံးဖြစ်အောင်တော့ လုပ်ပေးထားပါတယ်။ mm-kb Zip ဖိုင်ကို download ဆွဲ၊ extract လုပ်၊ အထဲက install ဆိုတဲ့ ဖိုင်လေးကို double click နှိပ်ပြီး ပေါ်လာတဲ့ box ထဲက Run ဆိုတဲ့ button လေးကို click နှိပ်ပေးရုံပါပဲ။ ပြီးရင်တော့ ရွေးစရာ Option box လေးပေါ်လာပါလိမ့်မယ်။ Install Unicode, Install Zawgyi, Install Both နဲ့ Uninstall ဆိုပြီးတွေ့ရပါလိမ့်မယ်။ ကြိုက်ရာရွေးပြီး Ok နှိပ်လိုက်တာနဲ့ status နေရာမှာ IBus icon လေးပေါ်လာပါလိမ့်မယ်။ ပေါ်လာတဲ့အထိတော့ခဏလောက်စောင့်ဖို့လိုပါလိမ့်မယ်။ System font changes ဖြစ်သွားမှာဖြစ်တဲ့အတွက် ခဏလောက်တော့လေးသွားနိုင်ပါတယ်။ desktop ပြန်သွက်သွားပြီဆိုရင်တော့ စသုံးလို့ရပါပြီ။ \"Alt+Shift\" နဲ့ keyboard ပြောင်းနိုင်ပြီး အင်္ဂလိပ်နဲ့ မြန်မာကိုတော့ left shift တစ်ချက်ဖိရုံနဲ့ ပြောင်းနိုင်ပါတယ်။ အားလုံးပဲ စမ်းပြီးသုံးကြည့်ကြပါ။ ပြဿနာတစ်စုံတစ်ခုရှိခဲ့ရင်လဲ report လုပ်နိုင်ပါတယ်။ Source on GitHub : https://github.com/seriousblaze/mm-kb Download : https://github.com/seriousblaze/mm-kb/archive/master.zip","tags":"Ubuntu","loc":"http://naingyeminn.com/posts/2013/07/12/myanmar-keyboard-for-ubuntu/","title":"Myanmar Kyeboard for Ubuntu"}]}